{
  "E-1000": "Não tem uma sessão iniciada, por favor inicie a sessão",
  "E-1001": "A sua conta não possui privilégios necessários para aceder à este recurso",
  "E-1002": "Ocorreu algum erro na aplicação, o servidor não foi capaz de processar o seu pedido",
  "E-1003": "Não deve ter a sessão iniciada, por favor termine a sua sessão antes de poder aceder à este recurso",
  "E-1004": "Falha ao actualizar a entidade, provavelmente devido à algum dado mal introduzido, por favor verifique os dados do seu formulário",
  "E-1005": "Rota não encontrada,",
  "E-1006": "Falha ao criar a entidade, provavelmente devido à algum dado mal introduzido, por favor verifique os dados do seu formulário",
  "E-1007": "Falha ao eliminar a entidade",
  "E-1008": "Falha ao buscar o recurso, isso pode dever-se à parâmetros de busca mal introduzidos",
  "E-1010": "Token inválido",
  "E-1011": "Falha ao reiniciar a palavra passe",
  "E-1012": "Falha ao recuperar a palavra passe",
  "E-1013": "Falha ao redefinir a palavra passe",
  "E-1014": "Os dados enviados não obedecem ao schema definido",
  "E-1015": "Falha ao redefinir a palavra passe, isto pode dever-se à palavra passe incorrecta",
  "E-1018": "O método HTTP solicitado, não é permitido para esta rota",
  "E-1020": "Os dados não obedecem ao esquema definido. Você só pode ter um número máximo de 6 colunas ativas",
  "E-1021": "Falha ao gerar o token",
  "S-3000": "Entidade criada com sucesso!",
  "S-3001": "Entidade eliminada com sucesso!",
  "S-3002": "Entidade encontrada com sucesso!",
  "S-3003": "Entidade actualizada com sucesso!",
  "S-3004": "Pedido processado com sucesso!",
  "S-3005": "Token validado com sucesso!",
  "S-3006": "Palavra-passe reiniciada com sucesso!",
  "S-3007": "Por favor, verifique a sua caixa de entrada se recebeu o email com o link de recuperação da palavra-passe",
  "S-3008": "Palavra-passe actualizada com sucesso!",
  "S-3009": "User autenticado com sucesso!",
  "S-3010": "Sessão terminada com sucesso!",
  "W-2000": "Não foi possível terminar a sessão do usuário",
  "W-2001": "O nome de usuário/email ou a palavra-passe está incorrecta"
}
